Repository: DEFRA/nipts-pts-web
Catalog: src/Defra.PTS.Web.UI/Resources/iSharedResource.*.resx
Languages: cy

source: Accessibility statement
cy: Datganiad hygyrchedd

source: Address
cy: Cyfeiriad

source: Continue
cy: Parhau

source: Cookies
cy: Cwcis

source: Download your application
cy: Lawrlwytho’ch cais

source: Download your document
cy: Lawrlwytho’ch dogfen

source: Email
cy: Ebost

source: give your feedback (opens in new tab)
cy: adborth yn ein helpu i'w wella (yn agor mewn tab newydd)

source: Lifelong pet travel documents
cy: Dogfennau teithio gydol oes i anifeiliaid anwes

source: Invalid documents
cy: Dogfennau annilys

source: Manage account
cy: Rheoli’r cyfrif

source: Name
cy: Enw

source: Phone number
cy: Rhif ffôn

source: Print your application
cy: Argraffu’ch cais

source: Print your document
cy: Argraffu’ch dogfen

source: Privacy notice
cy: Hysbysiad preifatrwydd

source: Sign out
cy: Allgofnodi

source: Taking a pet from Great Britain to Northern Ireland
cy: Mynd ag anifail anwes o Brydain Fawr i Ogledd Iwerddon

source: Terms and conditions
cy: Telerau ac amodau

source: This is a new service. Help us improve it and
cy: Mae hwn yn wasanaeth newydd - bydd eich

source: will help us to improve it.
cy: yn ein helpu i'w wella.

source: Mixed breed or unknown
cy: Brid cymysg neu anhysbys

source: Pekingese
cy: Pecinî

source: Pomeranian
cy: Pomeraniad

source: Toy Poodle
cy: Pwdl (Pwdl Tegan)

source: Italian Greyhound
cy: Milgi Eidalaidd

source: Cavalier King Charles Spaniel
cy: Sbaengi Siarl

source: Afghan Hound
cy: Ci Affgan

source: Basset Hound
cy: Ci Basset

source: Beagle
cy: Corhelgi

source: Bloodhound
cy: Gwaetgi

source: Greyhound
cy: Milgi

source: Whippet
cy: Corfilgi

source: Cocker Spaniel
cy: Llamgi

source: English Setter
cy: Cyfeirgi Seisnig

source: German Shorthaired Pointer
cy: Daeargi Almaenig blew cwta

source: Golden Retriever
cy: Adargi melyn

source: Irish Setter
cy: Cyfeirgi Gwyddelig

source: Labrador Retriever
cy: Adargi Labrador

source: Boxer
cy: Bocser

source: Chihuahua
cy: Chihuahuah

source: Doberman Pinscher
cy: Dobermann Pinscher

source: Great Dane
cy: Ci mawr Denmarc

source: Siberian Husky
cy: Hysgi Siberia

source: Saint Bernard
cy: Ci Sant Bernard

source: Alaskan Malamute
cy: Ci Esgimo Alasca

source: Airedale Terrier
cy: Daeargi Airedale

source: Bull Terrier
cy: Daeargi tarw

source: Cairn Terrier
cy: Daeargi byrgoes

source: Fox Terrier
cy: Ci codi llwynog

source: Irish Terrier
cy: Daeargi Gwyddelig

source: Jack Russell Terrier
cy: Daeargi Jack Russell

source: Scottish Terrier
cy: Daeargi Albanaidd

source: West Highland White Terrier
cy: Daeargi gwyn yr Ucheldiroedd

source: Bulldog
cy: Ci tarw

source: Chow Chow
cy: Chow

source: Dalmatian
cy: Ci Dalmataidd

source: French Bulldog
cy: Ci tarw Frengig

source: Poodle (Standard and Miniature)
cy: Pwdl (Tal a Bychan)

source: Australian Shepherd
cy: Ci defaid Awstralia

source: Border Collie
cy: Ci defaid y goror

source: Collie
cy: Ci defaid

source: German Shepherd
cy: Bleiddgi'r Almaen

source: Old English Sheepdog
cy: Hen gi defaid Seisnig

source: Shetland Sheepdog
cy: Ci defaid Shetland

source: Belgian Malinois
cy: Malinois Gwlad Belg

source: Corgi (Pembroke and Cardigan)
cy: Corgi (Penfro ac Aberteifi)

source: Belgian Tervuren
cy: Tervuren Gwlad Belg

source: Bernese Mountain Dog
cy: Mynyddgi Bern

source: Boston Terrier
cy: Daeargi Boston

source: Newfoundland
cy: Ci’r Tir Newydd

source: Portuguese Water Dog
cy: Ci dŵr Portiwgal

source: Pug
cy: Ci smwt

source: Domestic Shorthair
cy: Cath ddomestig blew cwta

source: Domestic Longhair
cy: Cath ddomestig blew hir

source: Domestic Mediumhair
cy: Cath ddomestig blew canolig

source: Persian
cy: Cath Bersia

source: Exotic Shorthair
cy: Cath estron blew cwta

source: Siamese
cy: Cath Siám

source: Oriental Shorthair
cy: Cath ddwyreiniol blew cwta

source: Oriental Longhair
cy: Cath ddwyreiniol blew hir

source: Maine Coon
cy: Cath Maine

source: British Shorthair
cy: Cath Brydeinig blew cwta

source: American Shorthair
cy: Cath Americanaidd blew cwta

source: Norwegian Forest Cat
cy: Cath fforestydd Norwy

source: Bengal
cy: Cath Bengal

source: Savannah
cy: Cath safana

source: Russian Blue
cy: Cath las Rwsia

source: Sphynx
cy: Sffincs

source: Scottish Fold
cy: Cath clustiau plyg o’r Alban

source: Devon Rex
cy: Rex Dyfnaint

source: Cornish Rex
cy: Rex Cernyw

source: Himalayan
cy: Cath Himalaiaidd

source: Scottish Fold Longhair
cy: Cath clustiau plyg blew hir o’r Alban

source: Siberian
cy: Cath Siberia

source: Abyssinian
cy: Cath Abysinia

source: Burmese
cy: Cath Byrma

source: Chartreux
cy: Cath Chartreux

source: Tonkinese
cy: Cath Toncin

source: Turkish Angora
cy: Cath Angora Twrci

source: Turkish Van
cy: Cath Fan Twrci

source: Manx
cy: Cath gwta

source: Select or enter the breed of your pet
cy: Dewiswch neu roi frîd eich anifail anwes

source: Day
cy: Diwrnod

source: Month
cy: Mis

source: Year
cy: Blwyddyn

source: Black
cy: Du

source: Black sable
cy: Sabl du

source: Brindle (tiger stripes)
cy: Brychlwyd (streipiau teigr)

source: Brown, tan or chocolate
cy: Brown, melynddu neu siocled

source: Champagne
cy: Siampên

source: Chocolate
cy: Siocled

source: Cinnamon
cy: Sinamon

source: Ginger
cy: Coch

source: Gold or yellow
cy: Aur neu felyn

source: Grey or silver
cy: Llwyd neu arian

source: Merle (white flecks)
cy: Brith (brychni gwyn)

source: Other
cy: Arall

source: Red
cy: Coch

source: Sable
cy: Sabl

source: Silver
cy: Arian

source: Tabby
cy: Brych

source: Tortoiseshell
cy: Trilliw

source: Tuxedo
cy: Twcsido

source: White
cy: Gwyn

source: White (albino)
cy: Gwyn (albino)

source: White, cream or sand
cy: Gwyn, hufen neu dywod

source: Grey, silver or blue
cy: Llwyd, arian neu las

source: Back
cy: Yn ôl

source: No
cy: Nac oes

source: Yes
cy: Oes

source: Mixed breed
cy: Brid cymysg

source: You’re about to be signed out
cy: Rydych ar fin cael eich allgofnodi

source: For your security, we will sign you out in
cy: Er eich diogelwch, byddwn yn eich allgofnodi cyn pen

source: en
cy: cy

source: Stay signed in
cy: Parhau i fod wedi’ch mewngofnodi

source: Get help
cy: Cael help

source: Need help using this service?
cy: Angen help gyda'r gwasanaeth yma?

source: Privacy notice (opens in new tab)
cy: Hysbysiad preifatrwydd (yn agor mewn tab newydd)
