Repository: DEFRA/nipts-pts-web
Catalog: src/Defra.PTS.Web.UI/Resources/Views.Content.AccessibilityStatement.*.resx
Languages: cy

source: Accessibility statement for ‘Taking a dog, cat or ferret from Great Britain to Northern Ireland’
cy: Datganiad hygyrchedd ar gyfer 'Mynd â chi, cath neu ffured o Brydain Fawr i Ogledd Iwerddon'

source: This accessibility statement applies to the ‘Taking a dog, cat or ferret from Great Britain to Northern Ireland’ service. This website is run by the Department for Environment, Food and Rural Affairs.
cy: Mae'r datganiad hygyrchedd yma yn gymwys i'r gwasanaeth 'Mynd â chi, cath neu ffured o Brydain Fawr i Ogledd Iwerddon'. Adran yr Amgylchedd, Bwyd a Materion Gwledig sy’n rhedeg y wefan yma.

source: We want as many people as possible to be able to use this website. For example, that means you should be able to:
cy: Rydyn ni am i gynifer o bobl â phosibl allu defnyddio'r wefan yma. Er enghraifft, mae hyn yn golygu y dylech fod yn gallu:

source: change colours, contrast levels and fonts using browser or device settings
cy: newid lliwiau, lefelau cyferbyniad a ffontiau gan ddefnyddio gosodiadau’r porwr neu’r ddyfais

source: zoom in up to 400% without the text spilling off the screen
cy: chwyddo i mewn hyd at 400% heb i'r testun ollwng oddi ar y sgrin

source: navigate most of the website using a keyboard or speech recognition software
cy: llywio'r rhan fwyaf o'r wefan gan ddefnyddio bysellfwrdd neu feddalwedd adnabod llais

source: listen to most of the website using a screen reader (including the most recent versions of JAWS, NVDA and VoiceOver)
cy: gwrando ar y rhan fwyaf o'r wefan gan ddefnyddio darllenydd sgrin (gan gynnwys fersiynau diweddaraf JAWS, NVDA a VoiceOver)

source: We’ve also made the website text as simple as possible to understand.
cy: Rydyn ni hefyd wedi gwneud testun y wefan mor syml â phosibl i'w ddeall.

source: How accessible this website is
cy: a mor hygyrch yw'r wefan yma

source: This website is fully accessible.
cy: Mae'r wefan yma yn gwbl hygyrch.

source: Feedback and contact information
cy: Adborth a gwybodaeth gysylltu

source: If you’d like support applying for a lifelong pet travel document, phone 03000 200 301. The line is open from 8.30am to 5pm, Monday to Friday (excluding bank holidays).
cy: Os hoffech gael cymorth i wneud cais am ddogfen deithio gydol oes i anifeiliaid anwes, ffoniwch 03000 200 301. Mae'r llinell yn agored rhwng 8.30am a 5pm, o ddydd Llun i ddydd Gwener (ac eithrio gwyliau banc).

source: Contact us:
cy: Cysylltwch â ni:

source: if you find any problems not listed on this page or think we’re not meeting accessibility requirements
cy: os byddwch yn gweld unrhyw broblemau sydd heb eu rhestru ar y tudalen yma neu os ydych chi'n credu nad ydyn ni’n bodloni gofynion hygyrchedd

source: if you need information on this website in a different format, like accessible PDF, large print, easy read, audio recording or braille
cy: os oes arnoch chi angen gwybodaeth ar y wefan yma mewn fformat gwahanol, fel PDF hygyrch, print bras, hawdd ei ddarllen, recordiad sain neu braille

source: Contact us by:
cy: Cysylltwch â ni drwy’r canlynol:

source: Phone: 03000 200 301 – from 8.30am to 5pm, Monday to Friday (excluding bank holidays)
cy: Ffôn: 03000 200 301 – rhwng 8.30am a 5pm, dydd Llun i ddydd Gwener (ac eithrio gwyliau banc)

source: We’ll consider your request and get back to you within 5 days.
cy: Byddwn yn ystyried eich cais ac yn cysylltu â chi o fewn 5 diwrnod.

source: Enforcement procedure
cy: Gweithdrefn orfodi

source: Technical information about this website’s accessibility
cy: Gwybodaeth dechnegol am hygyrchedd y wefan yma

source: Compliance status
cy: Statws cydymffurfio

source: Preparation of this accessibility statement
cy: Paratoi'r datganiad hygyrchedd yma

source: This statement was prepared on 6 February 2025. It was last reviewed on 17 July 2025.
cy: Cafodd y datganiad yma ei baratoi ar 6 Chwefror 2025. Y tro diwethaf iddo gael ei adolygu oedd 17 Gorffennaf 2025.

source: This website was last tested on 8 May 2025 against the WCAG 2.2 AA standard.
cy: Y tro diwethaf i'r wefan yma gael ei phrofi oedd 8 Mai 2025 yn erbyn safon WCAG 2.2 AA.

source: The test was carried out by Digital Accessibility Centre. The most viewed pages were tested using automated testing tools by our website team.
cy: Cafodd y prawf ei gynnal gan y Ganolfan Hygyrchedd Digidol. Cafodd y tudalennau a welir fwyaf eu profi drwy ddefnyddio offer profi awtomataidd gan ein tîm gwefannau.

source: AbilityNet (opens in new tab)
cy: AbilityNet (yn agor mewn tab newydd)

source: has advice on making your device easier to use if you have a disability.
cy: gyngor ar wneud eich dyfais yn haws i'w defnyddio os oes gennych anabledd.

source: Find out about call charges (open in new tab)
cy: Rhagor o wybodaeth am daliadau am alwadau (yn agor mewn tab newydd)

source: Email:
cy: Ebost:

source: The Equality and Human Rights Commission (EHRC) is responsible for enforcing the Public Sector Bodies (Websites and Mobile Applications) (No. 2) Accessibility Regulations 2018 (the ‘accessibility regulations’). If you’re not happy with how we respond to your complaint,
cy: Mae’r Comisiwn Cydraddoldeb a Hawliau Dynol (EHRC) yn gyfrifol am orfodi Rheoliadau Hygyrchedd Cyrff y Sector Cyhoeddus (Gwefannau a Chymwysiadau Symudol) (Rhif 2) 2018 (y ‘rheoliadau hygyrchedd’). Os nad ydych chi’n fodlon ar y ffordd rydyn ni’n ymateb i'ch cwyn,

source: contact the Equality Advisory and Support Service (EASS) (opens in a new tab)
cy: cysylltwch â'r Gwasanaeth Cynghori a Chymorth Cydraddoldeb (EASS) (yn agor mewn tab newydd)

source: The website is fully compliant with the
cy: Mae'r wefan yn cydymffurfio'n llawn â safon AA

source: Web Content Accessibility Guidelines (WCAG) 2.2 (w3.org) (opens in a new tab)
cy: Canllawiau Hygyrchedd Cynnwys y We (WCAG) 2.2 (w3.org) (yn agor mewn tab newydd).

source: The Department for Environment, Food and Rural Affairs is committed to making its website accessible, in accordance with the
cy: Mae Adran yr Amgylchedd, Bwyd a Materion Gwledig wedi ymrwymo i wneud ei gwefan yn hygyrch, yn unol â

source: Public Sector Bodies (Websites and Mobile Applications) (No. 2) Accessibility Regulations 2018 (opens in a new tab).
cy: Rheoliadau Hygyrchedd Cyrff y Sector Cyhoeddus (Gwefannau a Chymwysiadau Symudol) (Rhif 2) 2018 (yn agor mewn tab newydd).
