Repository: DEFRA/nipts-pts-web
Catalog: src/Defra.PTS.Web.UI/Resources/Views.TravelDocument.Acknowledgement.*.resx
Languages: cy

source: APHA may contact you and ask for more evidence to support your application.
cy: Efallai y bydd APHA yn cysylltu â chi i ofyn am ragor o dystiolaeth i ategu’ch cais.

source: Application submitted
cy: Cais wedi’i gyflwyno

source: Apply for another lifelong pet travel document
cy: Gwneud cais am ddogfen deithio gydol oes arall i anifeiliaid anwes

source: If someone else is taking your pet
cy: Os bydd rhywun arall yn mynd â’ch anifail anwes

source: the lifelong pet travel document
cy: y ddogfen teithio gydol oes i anifeiliaid anwes

source: They will need:
cy: Bydd arnyn nhw angen:

source: to sign a declaration, if asked to, at the ferry port or airport
cy: llofnodi datganiad, os gofynnir iddyn nhw, yn y porthladd fferis neu’r maes awyr

source: View all your lifelong pet travel documents
cy: Gweld eich holl ddogfennau teithio gydol oes i anifeiliaid anwes

source: We have sent you a confirmation email.
cy: Rydyn ni wedi anfon neges gadarnhau atoch drwy’r ebost.

source: We’ve sent your application to the Animal and Plant Health Agency (APHA) for review.
cy: Rydyn ni wedi anfon eich cais at yr Asiantaeth Iechyd Anifeiliaid a Phlanhigion (APHA) i'w adolygu.

source: What happens next
cy: Beth sy’n digwydd nesaf

source: written approval from you, like a letter or email
cy: cymeradwyaeth ysgrifenedig gennych chi, fel llythyr neu neges ebost

source: You will receive a response to your application within 5 working days.
cy: Fe gewch chi ymateb i'ch cais o fewn 5 diwrnod gwaith.

source: Your reference number
cy: Eich rhif cyfeirnod
