Repository: DEFRA/nipts-pts-web
Catalog: src/Defra.PTS.Web.UI/Resources/Views.Content.TermsAndConditions.*.resx
Languages: cy

source: Northern Ireland Pet Travel Scheme terms and conditions
cy: Telerau ac amodau Cynllun Teithio Anifeiliaid Anwes Gogledd Iwerddon

source: These terms and conditions provide guidance for pet owners or authorised persons using the Northern Ireland Pet Travel Scheme (the Scheme). The Scheme is part of the
cy: Mae'r telerau a'r amodau hyn yn rhoi canllawiau i berchnogion anifeiliaid anwes neu bersonau awdurdodedig sy'n defnyddio Cynllun Teithio Anifeiliaid Anwes Gogledd Iwerddon (y "Cynllun"). Mae'r Cynllun yn rhan o

source: Windsor Framework (opens in a new tab)
cy: Fframwaith Windsor (yn agor mewn tab newydd)

source: . The Windsor Framework is a new set of trade rules between Northern Ireland and the rest of the UK created after Brexit.
cy: . Mae Fframwaith Windsor yn set newydd o reolau masnach rhwng Gogledd Iwerddon a gweddill y Deyrnas Unedig a grëwyd ar ôl Brexit.

source: The Scheme is for non-commercial pet movements only – cats, dogs (including assistance dogs) and ferrets.
cy: Mae'r Cynllun ar gael ar gyfer symudiadau anifeiliaid anwes anfasnachol yn unig – cathod, cŵn (gan gynnwys cŵn cymorth) a ffuredau.

source: Any movement that involves a change in ownership in Northern Ireland, such as a rescue organisation rehoming an animal or a breeder selling a litter, or any movement of 6 or more pets (not for the purpose of attending a show or sporting event) is classified as a commercial movement.
cy: Mae unrhyw symudiad sy'n golygu newid perchnogaeth yng Ngogledd Iwerddon, megis sefydliad achub sydd wrthi'n ailgartrefu anifail neu fridiwr sy'n gwerthu torllwyth, neu unrhyw symudiad sy'n cynnwys 6 neu ragor o anifeiliaid anwes (nid er mwyn mynd i sioe neu ddigwyddiad chwaraeon) yn cael ei ddosbarthu fel symudiad masnachol.

source: Read more about commercial movements
cy: Darllenwch ragor am symudiadau masnachol

source: Who are we
cy: Pwy ydyn ni

source: The Animal and Plant Health Agency (APHA) is the competent authority responsible for verifying the information you provide when you apply for a lifelong pet travel document (PTD) and issuing the PTD for the Scheme.
cy: Yr Asiantaeth Iechyd Anifeiliaid a Phlanhigion (APHA) yw'r awdurdod cymwys sy'n gyfrifol am wirio'r wybodaeth rydych chi'n ei darparu wrth wneud cais am ddogfen teithio gydol oes i anifeiliaid anwes (PTD) ac am roi'r PTD ar gyfer y Cynllun.

source: Travelling under the Scheme
cy: Teithio o dan y Cynllun

source: If you wish to travel under the Scheme, you must apply for a lifelong PTD if you are travelling with your pet(s) to Northern Ireland from England, Scotland or Wales.
cy: Os ydych chi'n dymuno teithio o dan y Cynllun, rhaid ichi wneud cais am PTD gydol oes os ydych chi'n teithio gyda'ch anifail anwes i Ogledd Iwerddon o Gymru, Lloegr neu'r Alban.

source: If you are a Northern Ireland resident and you are travelling from Northern Ireland to Great Britain and then directly back to Northern Ireland, you do not need to apply for a PTD. However, your pet must be microchipped to travel.
cy: Os ydych chi'n byw yng Ngogledd Iwerddon ac yn teithio o Ogledd Iwerddon i Brydain Fawr ac yna'n dychwelyd yn uniongyrchol i Ogledd Iwerddon, does dim angen ichi wneud cais am PTD. Serch hynny, mae'n rhaid i'ch anifail fod â meicrosglodyn er mwyn cael teithio.

source: A 'pet' is a dog (including a guide dog or assistance dog), cat or ferret.
cy: 'Anifail anwes' yw ci (gan gynnwys ci tywys neu gi cymorth), cath neu ffured.

source: Each pet must have its own PTD and be microchipped with a 15-digit chip (which is the UK standard). The microchip must meet ISO Standards 11784, apply HDX or FDX-B technology and be capable of being read by a reading device compatible with ISO standard 11785.
cy: Rhaid i bob anifail anwes gael ei PTD ei hun a bod wedi'i feicrosglodynnu. Rhaid i'r meicrosglodyn fod wedi'i gofrestru ar gronfa ddata yn y Deyrnas Unedig a rhaid iddo fod yn sglodyn 15 digid (sef safon y Deyrnas Unedig). Rhaid i'r meicrosglodyn fodloni safonau ISO 11784, defnyddio technoleg HDX neu FDX-B a gallu cael ei ddarllen gan ddyfais ddarllen sy'n gydnaws â safon ISO 11785.

source: You may only travel with 5 pets or fewer under the Scheme.
cy: Cewch deithio gyda 5 anifail anwes neu lai yn unig o dan y Cynllun.

source: If you have 6 pets or more, to travel under the Scheme you must have written evidence with you that you are travelling to Northern Ireland or Great Britain to attend or return from a pet show. If attending a show, the pets must be at least 6 months old and each pet will need its own PTD and to be microchipped.
cy: Os oes gennych chi 6 anifail anwes neu fwy, er mwyn teithio o dan y Cynllun mae'n rhaid bod gennych dystiolaeth ysgrifenedig gyda chi eich bod yn teithio i Ogledd Iwerddon neu Brydain Fawr er mwyn mynd i sioe anifeiliaid anwes neu i ddychwelyd oddi yno. Os ydych chi'n mynd i sioe, rhaid i'r anifeiliaid anwes fod yn 6 mis oed o leiaf a bydd angen PTD a meicrosglodyn ar bob anifail anwes.

source: The PTD does not allow you to travel to an EU country with your pet (including the Republic of Ireland).
cy: Nid yw'r PTD yn caniatáu ichi deithio i wlad yn yr UE gyda'ch anifail anwes (gan gynnwys Gweriniaeth Iwerddon).

source: When you apply for the Scheme, you will be required to sign a declaration to confirm that you will not be travelling with your pet to the EU.
cy: Pan fyddwch chi'n gwneud cais i'r Cynllun, bydd gofyn ichi lofnodi datganiad i gadarnhau na fyddwch chi'n teithio gyda'ch anifail anwes i'r UE.

source: If applying online, you digitally sign this declaration by ticking a box just before you submit your application for a PTD. If you apply by phone, you must sign the declaration on the paper PTD when it arrives in the post and before you travel.
cy: Os byddwch chi'n gwneud cais ar-lein, fe fyddwch chi'n llofnodi'r datganiad yma yn ddigidol trwy dicio blwch ychydig cyn ichi gyflwyno'ch cais am PTD. Os byddwch chi'n gwneud cais dros y ffôn, rhaid ichi lofnodi'r datganiad ar y PTD papur pan fydd yn cyrraedd yn y post a chyn ichi deithio.

source: If someone else is traveling with your pet, they need to carry the PTD and also confirmation in writing from the pet owner that they are an 'authorised person'. The authorised person must sign a declaration to confirm that they are not travelling on to an EU country (including the Republic of Ireland).
cy: Os mai rhywun arall sy'n teithio gyda'ch anifail anwes, mae angen iddyn nhw gario'r PTD a chadarnhad ysgrifenedig gan berchennog yr anifail anwes eu bod nhw'n 'berson awdurdodedig'. Rhaid i'r person awdurdodedig lofnodi datganiad i gadarnhau nad ydyn nhw'n teithio ymlaen i wlad yn yr UE (gan gynnwys Gweriniaeth Iwerddon).

source: Pet travel document (PTD)
cy: Dogfen deithio i anifeiliaid anwes (PTD)

source: Applying for a PTD is free.
cy: Cewch wneud cais am PTD yn rhad ac am ddim.

source: To travel under the Scheme, your pet must be microchipped and the microchip number must be on the PTD.
cy: Er mwyn teithio o dan y Cynllun, rhaid i'ch anifail anwes fod wedi'i feicrosglodynnu a rhaid i rif y meicrosglodyn fod ar y PTD.

source: To apply, you must:
cy: Er mwyn gwneud cais, mae'n rhaid ichi fod:

source: live in England, Scotland or Wales
cy: yn byw yng Nghymru, Lloegr neu'r Alban

source: have your pet microchipped
cy: wedi cael meicrosglodyn i'ch anifail anwes

source: be the pet owner
cy: yn berchennog yr anifail anwes

source: be aged 16 or over
cy: yn 16 oed neu'n hŷn

source: If you apply online, you will get a digital PTD. You can print this out if you want to. You can show the digital PTD or a print-out at the GB ferry port or on arrival at the NI airport.
cy: Os byddwch chi'n gwneud cais ar-lein, fe gewch chi PTD digidol. Gallwch ei argraffu os ydych chi'n dymuno. Gallwch ddangos y PTD digidol neu allbrint yn y porthladd fferis ym Mhrydain Fawr neu wrth gyrraedd y maes awyr yng Ngogledd Iwerddon.

source: If you apply by phone, you will get a paper PTD posted to you.
cy: Os byddwch chi'n gwneud cais dros y ffôn, fe fydd PTD papur yn cael ei bostio atoch.

source: The PTD is valid for the lifetime of the pet but must be kept up to date. If your details change (for example, a change of address), you should apply for a new pet travel document and the previous PTD will be cancelled.
cy: Mae'r PTD yn ddilys drwy oes yr anifail anwes ond rhaid ei gadw'n gyfredol. Os bydd eich manylion yn newid (er enghraifft, newid cyfeiriad), dylech wneud cais am ddogfen deithio newydd i anifeiliaid anwes a bydd y PTD blaenorol yn cael ei ganslo.

source: Issues and liability
cy: Materion ac atebolrwydd

source: APHA aims to process your application within 5 working days, but APHA cannot be held liable if you do not receive a digital or paper PTD by the date you intend to travel. This includes delays in granting a PTD, or for delayed delivery or mis-delivery of any documents.
cy: Nod APHA yw prosesu'ch cais o fewn 5 diwrnod gwaith, ond does dim modd dal APHA yn atebol os na fyddwch chi'n cael PTD digidol neu bapur erbyn y dyddiad rydych chi'n bwriadu teithio. Mae hyn yn cynnwys oedi wrth ganiatáu PTD, neu oedi wrth anfon unrhyw ddogfennau neu anfon unrhyw ddogfennau i'r lle anghywir.

source: APHA also cannot be held liable if they cannot approve your application for a PTD (for example, the microchip number cannot be found).
cy: Does dim modd dal APHA yn atebol hefyd os na allan nhw gymeradwyo'ch cais am PTD (er enghraifft, os nad oes modd dod o hyd i'r meicrosglodyn wedi'i gofrestru ar y gronfa ddata a gymeradwywyd yn y Deyrnas Unedig).

source: APHA reserves the right to refuse an application. It can also cancel a PTD (for example, following the death of a pet or if you have to change any details, like your address).
cy: Mae APHA yn cadw'r hawl i wrthod cais. Maen nhw hefyd yn cael canslo PTD (er enghraifft, yn dilyn marwolaeth anifail anwes neu os oes rhaid ichi newid unrhyw fanylion, fel eich cyfeiriad).

source: If there is a problem with your PTD, staff at the port or airport will be able to help resolve the issue in most cases. If this is not possible or there are any other compliance issues, you may be asked to report to Northern Ireland's Department of Agriculture, Environment and Rural Affairs (DAERA)'s Sanitary and Phytosanitary (SPS) inspection facility when you arrive in Northern Ireland. This is for further checks, which may include checking the microchip in your pet.
cy: Os oes problem ynglŷn â'ch PTD, bydd staff yn y porthladd neu'r maes awyr yn gallu helpu i ddatrys y broblem gan amlaf. Os nad yw hyn yn bosibl neu os oes unrhyw faterion eraill ynglŷn â chydymffurfio, efallai y gofynnir ichi fynd i gyfleuster arolygu Adran Amaethyddiaeth, Amgylchedd a Materion Gwledig Gogledd Iwerddon (DAERA) pan fyddwch chi'n cyrraedd Gogledd Iwerddon, a hynny ar gyfer rhagor o wiriadau, a allai gynnwys gwirio'r meicrosglodyn yn eich anifail anwes.

source: You may also be advised not to travel to Northern Ireland if you do not meet the requirements of the Scheme. We might advise this because if you do decide to travel, once you arrive in Northern Ireland, DAERA might not be able to approve your onward journey from the port or airport for compliance reasons. You may be refused entry and asked to return to England, Scotland or Wales straightaway, and this will be at your own expense.
cy: Efallai y cewch eich cynghori i beidio â theithio i Ogledd Iwerddon os nad ydych chi'n bodloni gofynion y Cynllun. Fe allen ni ddweud hyn am ei bod yn bosibl, os penderfynwch chi deithio, ar ôl i chi gyrraedd Gogledd Iwerddon, na fydd DAERA yn gallu cymeradwyo'ch taith ymlaen o'r porthladd neu'r maes awyr am resymau cydymffurfio. Efallai y gwrthodir mynediad ichi a gofyn ichi ddychwelyd i Gymru, Lloegr neu'r Alban ar unwaith, a hynny ar eich traul chi'ch hun.

source: If you are asked to report to the SPS facility in Northern Ireland and you do not turn up, APHA reserves the right to suspend an individual from the Scheme for up to 12 months. This also applies if an authorised person travelling with your pet is referred to the SPS inspection facilities in Northern Ireland and does not turn up. If you need to travel with your pet while suspended, you must apply for a full animal health certificate.
cy: Os gofynnir ichi fynd i gyfleuster yr SPS yng Ngogledd Iwerddon ac na fyddwch chi'n dod yno, mae APHA yn cadw'r hawl i atal unigolyn o'r Cynllun am hyd at 12 mis. Mae hyn yn gymwys hefyd os bydd person awdurdodedig sy'n teithio gyda'ch anifail anwes yn cael ei gyfeirio at gyfleusterau archwilio'r SPS yng Ngogledd Iwerddon ac nad yw'n dod yno. Os oes angen ichi deithio gyda'ch anifail anwes tra byddwch chi wedi'ch atal, bydd rhaid ichi wneud cais am dystysgrif iechyd anifeiliaid lawn.

source: APHA has the right to withdraw access to the service.
cy: Mae gan APHA hawl i dynnu mynediad i'r gwasanaeth yn ôl.

source: Appeals
cy: Apelau

source: You can appeal if a PTD has not been approved, if a PTD has been cancelled or if you have been suspended from the Scheme.
cy: Cewch apelio os nad oes PTD wedi'i gymeradwyo, os oes PTD wedi'i ganslo neu os ydych chi wedi cael eich gwahardd o'r Cynllun.

source: You can contact APHA to appeal a decision.
cy: Gallwch gysylltu ag APHA i apelio yn erbyn penderfyniad.

source: Your data
cy: Eich data

source: You can find out about how your data is used at
cy: Gallwch weld sut mae'ch data'n cael ei ddefnyddio yn

source: Pet travel scheme privacy notice - GOV.UK (opens in a new tab)
cy: hysbysiad preifatrwydd y cynllun teithio anifeiliaid anwes - GOV.UK (yn agor mewn tab newydd)

source: More information
cy: Rhagor o wybodaeth

source: You can read more about the Scheme at
cy: Gallwch ddarllen rhagor am y Cynllun yn

source: Taking your pet dog, cat or ferret abroad: Travelling to an EU country or Northern Ireland - GOV.UK (opens in a new tab)
cy: Mynd â'ch ci, eich cath neu'ch ffured anwes dros y môr: Teithio i wlad yn yr UE neu Ogledd Iwerddon - GOV.UK (yn agor mewn tab newydd)

source: Contact APHA
cy: Cysylltu ag APHA

source: Contact APHA with any queries, including to let them know if any of your details (or your pet's details) change:
cy: Cysylltwch ag APHA gydag unrhyw ymholiadau, gan gynnwys i roi gwybod iddyn nhw os bydd unrhyw un neu ragor o'ch manylion (neu fanylion eich anifail anwes) yn newid:

source: Telephone: 03000 200 301
cy: Ffôn: 03000 200 301

source: Email:
cy: Ebost:

source: Find out about call charges (open in new tab)
cy: Rhagor o wybodaeth am daliadau am alwadau (yn agor mewn tab newydd)

source: Changes to these terms and conditions
cy: Newidiadau yn y Telerau a'r Amodau hyn

source: Please check these terms and conditions regularly. They can be updated at any time without notice.
cy: Gwiriwch y telerau a'r amodau hyn yn gyson. Gellir eu diweddaru unrhyw bryd heb rybudd.

source: You will agree to any changes if you continue to use the service after the terms and conditions have been updated.
cy: Byddwch yn cytuno i unrhyw newidiadau os byddwch chi'n parhau i ddefnyddio'r gwasanaeth ar ôl i'r telerau a'r amodau gael eu diweddaru.

source: This notice was last updated on 12 March 2025.
cy: Y tro diwethaf i'r hysbysiad yma gael ei ddiweddaru oedd 12 Mawrth 2025.
