Repository: DEFRA/nipts-pts-web
Catalog: src/Defra.PTS.Web.UI/Resources/Views.Content.Cookies.*.resx
Languages: cy

source: Cookies
cy: Cwcis

source: Success
cy: Llwyddiant

source: You’ve set your cookie preferences.
cy: Rydych chi wedi gosod eich dewisiadau cwci

source: This service uses cookies – cookies are small files saved on your phone, tablet or computer when you visit a website. We use 2 types of cookies on this site:
cy: Mae’r gwasanaeth hwn yn defnyddio cwcis – mae cwcis yn ffeiliau bach sy’n cael eu cadw ar eich ffôn, eich tabled neu eich cyfrifiadur pan fyddwch chi’n ymweld â gwefan. Rydyn ni’n defnyddio 2 fath o gwcis ar y safle hwn:

source: essential cookies – these are strictly necessary
cy: cwcis hanfodol – mae’r rhain yn gwbl angenrheidiol

source: optional cookies – these are used to measure your use of the service
cy: cwcis dewisol – defnyddir y rhain i fesur eich defnydd o’r gwasanaeth

source: You can learn more about cookies and how to manage them on the
cy: Gallwch ddysgu mwy am gwcis a sut i'w rheoli ar

source: website for the Information Commissioner’s Office (opens in a new tab).
cy: wefan Swyddfa'r Comisiynydd Gwybodaeth (yn agor mewn tab newydd)

source: Essential cookies (strictly necessary)
cy: Cwcis hanfodol (yn angenrheidiol yn unig)

source: We need to collect these cookies in order for the service to work.
cy: Mae angen i ni gasglu’r cwcis hyn er mwyn i’r gwasanaeth weithio.

source: Introductory cookie message
cy: Neges ragarweiniol am gwcis

source: You may see a pop-up welcome message when you first visit. A cookie is stored so that your computer knows you’ve seen it and knows not to show it again.
cy: Efallai y gwelwch neges groeso yn ymddangos pan fyddwch yn ymweld â’r wefan am y tro cyntaf. Mae cwci yn cael ei storio fel bod eich cyfrifiadur yn gwybod eich bod wedi gweld y neges ac i beidio â’i dangos eto.

source: Essential cookies we use
cy: Cwcis hanfodol rydym yn eu defnyddio

source: Name
cy: Enw

source: Purpose
cy: Pwrpas

source: Expires
cy: Yn dod i ben

source: Saves a message to let us know that you’ve seen our cookie message
cy: Yn cadw neges i roi gwybod i ni eich bod wedi gweld ein neges

source: Saves a message to let us know that you’ve accepted or rejected cookies
cy: Yn cadw neges i roi gwybod i ni eich bod wedi derbyn neu wrthod cwcis

source: 12 months
cy: 12 Mis

source: Other essential cookies
cy: Cwcis hanfodol eraill

source: When you close the browser
cy: Pan fyddwch chi’n cau'r porwr

source: 1 year
cy: Blwyddyn

source: 1 hour
cy: 1 awr

source: Prevents forgery attacks from other websites – this helps to keep your information secure
cy: Atal ymosodiadau ffugio gan wefannau eraill – mae hyn yn helpu i gadw eich gwybodaeth yn ddiogel

source: Stores the language of the service
cy: Storio iaith y gwasanaeth

source: Stores data you’ve provided during the session
cy: Storio’r data rydych chi wedi’i ddarparu yn ystod y sesiwn

source: Optional cookies
cy: Cwcis dewisol

source: We use Google Analytics software to understand how people use this service. We do this to help make sure the site is meeting the needs of its users and to help us make improvements.
cy: Rydym yn defnyddio meddalwedd Google Analytics i ddeall sut mae pobl yn defnyddio’r gwasanaeth hwn. Rydym yn gwneud hyn er mwyn gwneud yn siŵr bod y wefan yn diwallu anghenion y bobl sy'n ei defnyddio a’n helpu i wella’r wefan.

source: We do not collect or store your personal information (for example your name or address) so this information cannot be used to identify who you are.
cy: Nid ydym yn casglu nac yn storio eich gwybodaeth bersonol (er enghraifft eich enw neu’ch cyfeiriad) felly ni ellir defnyddio’r wybodaeth hon i adnabod pwy ydych chi.

source: We do not allow Google to use or share our analytics data.
cy: Nid ydym yn caniatáu i Google rannu ein data dadansoddi.

source: Google Analytics stores information about:
cy: Mae Google Analytics yn storio gwybodaeth am:

source: the pages you visit
cy: y tudalennau rydych chi’n ymweld â nhw

source: how long you spend on each page
cy: faint o amser rydych chi’n ei dreulio ar bob tudalen

source: how you arrived at the site
cy: sut y gwnaethoch chi gyrraedd y safle

source: what you click on while you visit the site
cy: beth ydych chi’n clicio arno wrth ymweld â'r safle

source: the device and browser you use
cy: y ddyfais a'r porwr rydych chi'n eu defnyddio

source: Google Analytics cookies we use
cy: Cwcis dadansoddeg Google rydym yn eu defnyddio

source: In 2 years
cy: 2 flynedd

source: Helps us to count how many people use the service by tracking if you’ve visited before
cy: Maent yn ein helpu ni i gyfrif faint o bobl sy’n defnyddio’r gwasanaeth drwy olrhain a ydych chi wedi ymweld o’r blaen

source: Do you want to accept Google Analytics cookies?
cy: Ydych chi am dderbyn cwcis Google Analytics?

source: Yes
cy: Oes

source: No
cy: Nac oes

source: Save cookies settings
cy: Cadw’r gosodiadau cwcis
