Repository: DEFRA/nipts-pts-web
Catalog: src/Defra.PTS.Web.Domain/Resources/ISharedResource.*.resx
Languages: cy

source: Enter a full postcode in the correct format, for example TF7 5AY or TF75AY
cy: Rhowch god post llawn yn y fformat cywir, er enghraifft TF7 5AY neu TF75AY

source: Enter a phone number, like 01632 960 001 or 07700 900 982
cy: Rhowch rif ffôn, fel 01632 960 001 neu 07700 900 982

source: Enter a postcode
cy: Rhowch god post

source: Enter a postcode in England, Scotland or Wales
cy: Rhowch god post yng Nghymru, Lloegr neu'r Alban

source: Enter your full name
cy: Rhowch eich enw llawn

source: Enter your phone number
cy: Rhowch eich rhif ffôn

source: Tell us if your details are correct
cy: Dwedwch a yw eich manylion chi’n gywir

source: Tell us if your pet is male or female
cy: Dwedwch a yw'ch anifail anwes yn wryw ynteu'n fenyw

source: Tell us if you are taking a pet dog, cat or ferret
cy: Dwedwch a ydych chi'n mynd â chi anwes, cath anwes neu ffured anwes

source: Enter your full name, using 300 characters or less
cy: Rhowch eich enw llawn, gan ddefnyddio 300 o gymeriadau neu lai

source: Select your address from the list
cy: Dewiswch eich cyfeiriad o blith y rhestr

source: Enter a county using 100 characters or less
cy: Rhowch sir gan ddefnyddio 100 o gymeriadau neu lai

source: Enter your town or city
cy: Rhowch dref neu ddinas

source: Enter your town or city using 250 characters or less
cy: Rhowch dref neu ddinas gan ddefnyddio 250 o gymeriadau neu lai

source: Enter line 1 of your address
cy: Rhowch linell 1 eich cyfeiriad

source: Enter line 1 of your address using 250 characters or less
cy: Rhowch linell 1 eich cyfeiriad gan ddefnyddio 250 o gymeriadau neu lai

source: Enter line 2 of your address using 250 characters or less
cy: Rhowch linell 2 eich cyfeiriad gan ddefnyddio 250 o gymeriadau neu lai

source: Enter a breed using 150 characters or less
cy: Rhowch frid gan ddefnyddio 150 o gymeriadau neu lai

source: Select or enter the breed of your pet
cy: Dewiswch frid neu rhowch frid eich anifail anwes

source: Enter a date in the correct format, for example 11 4 2021
cy: Rhowch ddyddiad yn y fformat cywir, er enghraifft 11 4 2021

source: Enter a date that is after the pet’s date of birth
cy: Rhowch ddyddiad sydd ar ôl dyddiad geni'r anifail anwes

source: Enter a date that is in the past
cy: Rhowch ddyddiad sydd yn y gorffennol

source: Enter a date that is less than 34 years ago
cy: Nodwch ddyddiad sy’n llai na 34 mlynedd yn ôl

source: Enter your pet's name
cy: Rhowch enw eich anifail anwes

source: Enter your pet's name, using 300 characters or less
cy: Rhowch enw anifail anwes gan ddefnyddio 300 o gymeriadau neu lai

source: Describe the main colour of your cat
cy: Disgrifiwch brif liw eich cath

source: Describe the main colour of your cat, using 150 characters or less
cy: Disgrifiwch brif liw eich cath, gan ddefnyddio 150 o gymeriadau neu lai

source: Describe the main colour of your dog
cy: Disgrifiwch brif liw eich ci

source: Describe the main colour of your dog, using 150 characters or less
cy: Disgrifiwch brif liw eich ci, gan ddefnyddio 150 o gymeriadau neu lai

source: Describe the main colour of your ferret
cy: Disgrifiwch brif liw eich ffured

source: Describe the main colour of your ferret, using 150 characters or less
cy: Disgrifiwch brif liw eich ffured, gan ddefnyddio 150 o gymeriadau neu lai

source: Enter your pet's microchip number in the correct format
cy: Rhowch rif microsglodyn eich anifail anwes yn y fformat cywir

source: Enter your pet’s 15-digit microchip number
cy: Rhowch rif microsglodyn 15 digid eich anifail anwes

source: Enter your pet’s 15-digit microchip number – do not use spaces or special characters like hyphens or dashes
cy: Rhowch rif microsglodyn 15 digid eich anifail anwes – peidiwch â defnyddio bylchau na chymeriadau arbennig fel cysylltnod neu linell

source: Tell us if your pet is microchipped
cy: Dwedwch a oes gan eich anifail anwes ficrosglodyn

source: The microchip number is associated with another lifelong pet travel document
cy: Mae rhif y microsglodyn yn gysylltiedig â dogfen deithio gydol oes arall i anifail anwes.

source: There is a problem
cy: Mae yna broblem

source: Enter a 15-digit number, using only numbers
cy: Rhowch rif 15 digid, gan ddefnyddio rhifau yn unig

source: Enter your pet's microchip number
cy: Rhowch rif microsglodyn eich anifail anwes

source: Select the main colour of your cat
cy: Dewiswch brif liw eich cath

source: Select the main colour of your dog
cy: Dewiswch brif liw eich ci

source: Select the main colour of your ferret
cy: Dewiswch brif liw eich ffured

source: Describe your pet's significant feature
cy: Disgrifiwch nodwedd arwyddocaol eich anifail anwes

source: Describe your pet's significant feature, using 300 characters or less
cy: Disgrifiwch nodwedd arwyddocaol eich anifail anwes, gan ddefnyddio 300 o gymeriadau neu lai

source: Tell us if your pet has any significant features
cy: Dwedwch a oes gan eich anifail anwes unrhyw nodweddion arwyddocaol

source: Enter a date that is before the pet’s microchip date
cy: Rhowch ddyddiad sydd cyn rhif microsglodyn yr anifail anwes
